AmbiqMicro/lv_port_ambiq/lvgl_ambiq_porting/NemaGFX_hal/apollo510L_nemagfx/nema_hal.c
/*******************************************************************************
 * Copyright (c) 2022 Think Silicon S.A.
 *
   Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this header file and/or associated documentation files to use, copy,
 * modify, merge, publish, distribute, sublicense, and/or sell copies of the
 * Materials, and to permit persons to whom the Materials are furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Materials.
 *
 * MODIFICATIONS TO THIS FILE MAY MEAN IT NO LONGER ACCURATELY REFLECTS
 * NEMAGFX API. THE UNMODIFIED, NORMATIVE VERSIONS OF THINK-SILICON NEMAGFX
 * SPECIFICATIONS AND HEADER INFORMATION ARE LOCATED AT:
 *   https://think-silicon.com/products/software/nemagfx-api
 *
 *  The software is provided 'as is', without warranty of any kind, express or
 *  implied, including but not limited to the warranties of merchantability,
 *  fitness for a particular purpose and noninfringement. In no event shall
 *  Think Silicon S.A. be liable for any claim, damages or other liability, whether
 *  in an action of contract, tort or otherwise, arising from, out of or in
 *  connection with the software or the use or other dealings in the software.
 ******************************************************************************/


#ifdef BAREMETAL

#  ifndef WAIT_IRQ_POLL
#    define WAIT_IRQ_POLL               1
#  endif

#else  // BAREMETAL

#  ifndef WAIT_IRQ_POLL
#    define WAIT_IRQ_POLL               0
#  endif

#  ifndef WAIT_IRQ_BINARY_SEMAPHORE
#    define WAIT_IRQ_BINARY_SEMAPHORE   0
#  endif
#ifdef SYSTEM_VIEW
#  include "SEGGER_SYSVIEW_FreeRTOS.h"
#endif
#  include "FreeRTOS.h"
#  include "portable.h"
#  include "task.h"

#endif // BAREMETAL

//#include "interpose.h"
#include "nema_hal.h"
#include "nema_regs.h"
#include "nema_ringbuffer.h"
#include "nema_graphics.h"
#include "nema_error.h"
#include "nema_vg.h"
#include "am_mcu_apollo.h"
#include "am_hal_global.h"
#include "am_util_delay.h"
#include "am_mem.h"

#include <stdlib.h>


#ifdef NEMA_USE_CUSTOM_MALLOC
    #include "nema_sys_defs.h"
    static inline am_mem_control_t* nema_custom_get_heap(int pool)
    {
        switch (pool)
        {
            case NEMA_MEM_POOL_FB:
                return &ssram_heap;
            case NEMA_MEM_POOL_ASSETS:
                return &psram_heap;
            case NEMA_MEM_POOL_CL_RB:
            case NEMA_MEM_POOL_MISC:
            default:
                return &ssram_heap;
        }
    }
    /* NemaGFX requires CL buffer to be 8-byte aligned (CL_ALIGNMENT_MASK). Use aligned alloc for CL pool. */
    #define NEMA_CL_BUFFER_ALIGNMENT 8U
    static inline void* nema_custom_malloc_impl(int pool, size_t size)
    {
        am_mem_control_t *heap = nema_custom_get_heap(pool);
        if ((pool == NEMA_MEM_POOL_CL_RB) || (pool == NEMA_MEM_POOL_FB))
            return am_mem_heap_malloc_align(heap, size, NEMA_CL_BUFFER_ALIGNMENT);
        return am_mem_heap_malloc(heap, size);
    }
    static inline void nema_custom_free_impl(void *p)
    {
        if (p == NULL) return;
        uint32_t ptr_uint = (uint32_t)(uintptr_t)p;
        if (ptr_uint >= psram_heap.start_addr &&
            ptr_uint < psram_heap.start_addr + psram_heap.pool_size)
            am_mem_heap_free(&psram_heap, p);
        else
            am_mem_heap_free(&ssram_heap, p);
    }
    #define NEMA_CUSTOM_MALLOC(pool, size) nema_custom_malloc_impl(pool, size)
    #define NEMA_CUSTOM_FREE(ptr) nema_custom_free_impl(ptr)
#else
    #include "tsi_malloc.h"

    #ifndef VMEM_BASEADDR
        #define VMEM_BASEADDR       tsi_buffer
    #endif   //VMEM_BASEADDR

    #ifndef VMEM_SIZE
        #define VMEM_SIZE           (0x160000)
    #endif //VMEM_SIZE

    #if VMEM_BASEADDR==tsi_buffer
        static AM_SHARED_RW uint64_t tsi_buffer[VMEM_SIZE/8];
    #endif   //VMEM_BASEADDR

#endif

#ifndef NEMA_BASEADDR

    #if defined(AM_PART_BRONCO)
        #include "bronco.h"
    #elif defined(AM_PART_APOLLO510L)
        #include "apollo510L.h"
    #endif

    #define NEMA_BASEADDR       GPU_BASE
#endif

// IRQ number
#ifndef NEMA_IRQ
    #define NEMA_IRQ            ((IRQn_Type)28U)
#endif

// MAX pending CL in the core ring buffer
#ifndef MAX_PENDING_CL
#define MAX_PENDING_CL (200UL)
#endif

#if (MAX_PENDING_CL < 10)
#error "max pending CL must be bigger than 10"
#endif

nema_gfx_interrupt_callback nemagfx_cb = NULL;

// IRQ handler
//#define prvNemaInterruptHandler     am_gpu_isr


#if (defined(NEMA_MULTI_PROCESS) || defined(NEMA_MULTI_THREAD))
static int enable_mutices = 0;
#endif

static const uintptr_t nema_regs = (uintptr_t) NEMA_BASEADDR;

#if (defined(NEMA_MULTI_PROCESS) || defined(NEMA_MULTI_THREAD))
    #include "semphr.h"
    static SemaphoreHandle_t xMutex[MUTEX_MAX+1] = {NULL};
#endif

#ifndef BAREMETAL
#if WAIT_IRQ_BINARY_SEMAPHORE == 1

    #include "semphr.h"
    static SemaphoreHandle_t xSemaphore = NULL;

#else
    #include "task.h"
    static TaskHandle_t xHandlingTask = 0;

#endif
#endif /* BAREMETAL */

static volatile int last_cl_id = -1;
static volatile int expected_brk_id = 0;
static nema_ringbuffer_t ring_buffer_str = {{0}};

static void prvNemaInterruptHandler( void *pvUnused )
{

#ifdef APOLLO5_FPGA
    if(!nema_reg_read(NEMA_INTERRUPT))
        return;
#endif

    int current_cl_id = (int)nema_reg_read(NEMA_CLID);
    int previous_cl_id;

    do
    {
        /* Clear the interrupt */
        nema_reg_write(NEMA_INTERRUPT, 0);

        /* Clear pending register*/
        NVIC_ClearPendingIRQ(NEMA_IRQ);

        previous_cl_id = current_cl_id;

        /* Read again and compare with the previous one to prevent
         * a corner case where a new gpu_irq is triggered after reading the NEMA_CLID register
         * and before cleaning the NEMA_INTERRUPT register. */
        current_cl_id = (int)nema_reg_read(NEMA_CLID);
    }while(current_cl_id != previous_cl_id);

    /* Public the last_cl_id */
    last_cl_id = current_cl_id;

#ifndef BAREMETAL
#ifdef SYSTEM_VIEW
    traceISR_ENTER();
#endif

    BaseType_t xHigherPriorityTaskWoken;

#if WAIT_IRQ_BINARY_SEMAPHORE == 1
    xSemaphoreGiveFromISR(xSemaphore, &xHigherPriorityTaskWoken);
#else
    if ( xHandlingTask )
    {
        xTaskNotifyFromISR( xHandlingTask,
                            0,
                            eNoAction,
                            &xHigherPriorityTaskWoken );
    }

    /* If xHigherPriorityTaskWoken is now set to pdTRUE then a context switch
    should be performed to ensure the interrupt returns directly to the highest
    priority task.  The macro used for this purpose is dependent on the port in
    use and may be called portEND_SWITCHING_ISR(). */
    portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
#endif // WAIT_SEMA
#ifdef SYSTEM_VIEW
    traceISR_EXIT();
#endif
#endif // BAREMETAL

