AmbiqMicro/lv_port_ambiq/lvgl_ambiq_porting/NemaGFX_hal/apollo510L_nemagfx/nema_hal.c
}

void nema_buffer_destroy (nema_buffer_t * bo)
{
    nema_mutex_lock(MUTEX_MALLOC);


#ifdef NEMA_USE_CUSTOM_MALLOC
    NEMA_CUSTOM_FREE(bo->base_virt);
#else
    tsi_free(bo->base_virt);
#endif


    bo->base_virt = (void *)NULL;
    bo->base_phys = 0;
    bo->size      = 0;
    bo->fd        = -1;

    nema_mutex_unlock(MUTEX_MALLOC);
}

uintptr_t nema_buffer_phys (nema_buffer_t * bo)
{
    return bo->base_phys;
}

void nema_buffer_flush(nema_buffer_t * bo)
{
    nema_mutex_lock(MUTEX_FLUSH);

#if defined(NEMA_USE_CUSTOM_MALLOC) && defined(NEMA_CUSTOM_FLUSH)
    NEMA_CUSTOM_FLUSH(bo);
#else
    am_hal_cachectrl_range_t Range;
    Range.ui32Size = bo->size;
    Range.ui32StartAddr = bo->base_phys;
    am_hal_cachectrl_dcache_clean(&Range);
#endif

    __DSB();
    __ISB();

    nema_mutex_unlock(MUTEX_FLUSH);
}

static am_mem_control_t* get_heap(int pool)
{
    switch (pool)
    {
        case NEMA_MEM_POOL_FB:
            return &ssram_heap;
        case NEMA_MEM_POOL_ASSETS:
            return &psram_heap;
        case NEMA_MEM_POOL_CL_RB:
        case NEMA_MEM_POOL_MISC:
        default:
            return &ssram_heap;
    }
}

void nema_buffer_invalidate(nema_buffer_t * bo)
{

    am_mem_control_t* heap = get_heap(bo->fd);
    bool need_flush = (heap->cacheable) ? true : false;

    if(need_flush)
    {
        am_hal_cachectrl_range_t Range;
        Range.ui32Size = bo->size;
        Range.ui32StartAddr = bo->base_phys;
        am_hal_cachectrl_dcache_invalidate(&Range, false);
    }
}

bool nema_buffer_is_within_pool(int pool, uint32_t buf_start, uint32_t buf_length)
{
    am_mem_control_t* heap = get_heap(pool);

    uint32_t start_addr_pool = heap->start_addr;
    uint32_t end_addr_pool = heap->start_addr + heap->pool_size;

    if (buf_start < start_addr_pool || buf_start + buf_length > end_addr_pool)
    {
        return false;
    }

    return true;
}


void * nema_host_malloc (size_t size)
{
    nema_mutex_lock(MUTEX_MALLOC);

#ifdef NEMA_USE_CUSTOM_MALLOC
    void *ptr = NEMA_CUSTOM_MALLOC(NEMA_MEM_POOL_MISC, size);
#else
    void *ptr = tsi_malloc(size);
#endif

    nema_mutex_unlock(MUTEX_MALLOC);
    return ptr;
}

void nema_host_free (void * ptr)
{
    nema_mutex_lock(MUTEX_MALLOC);

#ifdef NEMA_USE_CUSTOM_MALLOC
    NEMA_CUSTOM_FREE(ptr);
#else
    tsi_free(ptr);
#endif

    nema_mutex_unlock(MUTEX_MALLOC);
}

int nema_mutex_lock (int mutex_id)
{
#if (defined(NEMA_MULTI_PROCESS) || defined(NEMA_MULTI_THREAD))
    if ((enable_mutices == 1) && (mutex_id >= 0) && (mutex_id <= MUTEX_MAX)) {
        xSemaphoreTake( xMutex[mutex_id], portMAX_DELAY );
    }
#endif
	return 0;
}

int nema_mutex_unlock (int mutex_id)
{
#if (defined(NEMA_MULTI_PROCESS) || defined(NEMA_MULTI_THREAD))
    if ((enable_mutices == 1) && (mutex_id >= 0) && (mutex_id <= MUTEX_MAX)) {
        xSemaphoreGive( xMutex[mutex_id] );
    }
#endif
	return 0;
}

am_hal_status_e nema_get_cl_status (int32_t cl_id)
{
    // CL_id is negative
    if ( cl_id < 0) {
        return AM_HAL_STATUS_SUCCESS;
    }

    // NemaP is IDLE, so CL has to be finished
    if ( nema_reg_read(NEMA_STATUS) == 0 ) {
        return AM_HAL_STATUS_SUCCESS;
    }

    int last_cl_id = (int)nema_reg_read(NEMA_CLID);
    if ( last_cl_id >= cl_id) {
        return AM_HAL_STATUS_SUCCESS;
    }
    return AM_HAL_STATUS_IN_USE;
}

//*****************************************************************************
//
//! @brief Check wether the core ring buffer is full or not
//!
//! @return True, the core ring buffer is full, we need wait for GPU before
//!         submit the next CL.
//!         False, the core ring buffer is not full, we can submit the next CL.
//*****************************************************************************
bool nema_rb_check_full(void)
{
    uint32_t total_pending_cl = 0;
    if(ring_buffer_str.last_submission_id > last_cl_id)
    {
        total_pending_cl = ring_buffer_str.last_submission_id - last_cl_id;
    }
    else if(ring_buffer_str.last_submission_id < last_cl_id)
    {
        if(last_cl_id == 0xFFFFFF)
        {
            total_pending_cl = ring_buffer_str.last_submission_id + 1;
        }
        else
        {
            //should never got here.
        }
    }

    return (total_pending_cl >= MAX_PENDING_CL);
}

void nema_reset_last_cl_id (void)
{
    last_cl_id = -1;
}

int nema_get_last_cl_id(void)
{
    return last_cl_id;
}

int nema_get_last_submission_id(void)
{
    return ring_buffer_str.last_submission_id;
}

//*****************************************************************************
//
// NemaGFX Garbage Collection (GC) Mechanism Implementation
//
//*****************************************************************************

/**
 * @brief Node for NemaGFX Garbage Collection
 */
typedef struct nema_gc_node_t {
    int cl_id;                                // Command List ID when submitted
    void *resource;                           // Pointer to the memory to free
    void (*free_cb)(void *);                  // Callback to free the memory
    struct nema_gc_node_t *next;              // Pointer to the next node in the list
} nema_gc_node_t;

// The head and tail of the custom linked list for tracking GC nodes
static nema_gc_node_t *nema_gc_head = NULL;
static nema_gc_node_t *nema_gc_tail = NULL;

void nema_gc_add(void * resource, void (*free_cb)(void *))
{
    nema_gc_run(); // Opportunistically run GC to keep memory footprint low

    if (!resource || !free_cb) return;

    // Allocate new node using nema_host_malloc
    nema_gc_node_t * node = (nema_gc_node_t *)nema_host_malloc(sizeof(nema_gc_node_t));
    uint32_t next_submission_id = nema_get_last_submission_id() + 1;
    if (node) {
        // The command list being built currently will be submitted with
        // ID = last_submission_id + 1. (with wrap-around applied)
        node->cl_id = next_submission_id > SUBMISSION_ID_MASK ? 0 : next_submission_id;
        node->resource = resource;
        node->free_cb = free_cb;
        node->next = NULL;

        // Append to the tail of the list in O(1) time
        if (nema_gc_tail == NULL) {
            nema_gc_head = node;
            nema_gc_tail = node;
        } else {
            nema_gc_tail->next = node;
            nema_gc_tail = node;
        }
    }
}

void nema_gc_run(void)
{
    int last_executed_cl_id = nema_get_last_cl_id();

    nema_gc_node_t * curr = nema_gc_head;
    nema_gc_node_t * prev = NULL;

